{
  "commits": [
    {
      "message": "build: add pglite dependency and configure vite",
      "files": [
        "package.json",
        "pnpm-lock.yaml",
        "public/pglite.data",
        "vite.config.js",
        "vite.config.ts"
      ],
      "description": "Adds the `@electric-sql/pglite` dependency and its data bundle. Updates Vite configuration to correctly handle WASM and data assets and excludes PGlite from optimization to prevent build issues."
    },
    {
      "message": "feat: implement core pglite client and types",
      "files": [
        "src/db/postgres/types.ts",
        "src/db/postgres/client.ts"
      ],
      "description": "Introduces `src/db/postgres/types.ts` for defining interfaces related to PGlite query results, fields, table schemas, and errors. Creates `src/db/postgres/client.ts` which provides a singleton PGlite client instance and functions for initialization, query execution, readiness checks, and database resets."
    },
    {
      "message": "feat: add pglite database helper functions",
      "files": [
        "src/db/postgres/helpers.ts"
      ],
      "description": "Adds `src/db/postgres/helpers.ts` containing utility functions for PGlite interactions. Includes `formatQueryResult` for consistent data representation, `parseError` for structured error handling, and functions to retrieve database metadata like `getTableList`, `getTableSchema`, and `getTableRowCount`."
    },
    {
      "message": "feat: create usePostgres react hook",
      "files": [
        "src/hooks/usePostgres.ts"
      ],
      "description": "Introduces `src/hooks/usePostgres.ts`, a custom React hook. This hook encapsulates the logic for initializing PGlite, managing its loading and ready states, and handling errors. It provides a convenient `executeQuery` method for React components to interact with the PGlite database."
    },
    {
      "message": "feat: integrate pglite into main app ui",
      "files": [
        "src/App.tsx"
      ],
      "description": "Updates `src/App.tsx` to utilize the new `usePostgres` hook. Displays the PGlite initialization status (loading, ready, error) to the user. Adds a basic user interface with a textarea for SQL input and a button to execute queries, presenting the results in a formatted block. Adjusts the page layout and title for the new functionality."
    }
  ]
}
